import React from 'react';
import '../programmingLearning/programmingLearning.css'

const Frontend = () => {
  return (
    <div  className='front-end'>
    <div className="container">
        <h2 className="frontend-title">
           كل ما يجب تعرفه عن كورس Front-End
        </h2>

        <div className="box ">
            <h2 className="box-title">تفاصيل كورس ال Front-End</h2>
            <p>
            Frontend course <br />

Intro <br />
Html <br />
CSS <br />
Javascript <br />
Bootstrap <br />
React js <br />

مع تطبيق عملي مستمر في كل محاضرة + عمل بروجيكت كامل في الكورس <br />

بتكون بعد الكورس مؤهل لعمل مشروع كامل Web Application بنفسك او موقع تجاري <br />

            </p>
        </div>


        <div className="box">
            <h2 className="box-title">مراحل تعلم Front-End</h2>
            <p>
              <span>1 - تعلم لغة HTML</span> 
            لغة HTML هي لغة تتكون من الوسوم والأوامر التي يستخدمها مصممو الويب لإنشاء مواقع الويب.
            تعتبر لغة HTML أحد الأدوات الأساسية الثلاثة في إنشاء صفحات الويب: توفر لغة HTML الهيكل أو الطريقة التي سيظهر بها النص والصور وما إلى ذلك على موقع الويب. تعيّن CSS (أوراق الأنماط المتتالية) الخصائص المرئية لهذه العناصر ، مثل الألوان والتنسيق والتخطيط. وفي الوقت نفسه ، تجعل Javascript هذه العناصر تتصرف بطرق معينة اعتمادًا على إجراء المستخدم. على سبيل المثال ، يمكن أن يزيد حجم خط النص عندما يقوم المستخدمون بتمرير الماوس أو النقر فوق زر في الصفحة.


<span>2 - تعلم لغة CSS</span>
تعتبر CSS -اختصار ل - (Cascading Style Sheet) لغة توصيفية تقوم بمنح موقع الويب شكله الجميل وتصميمه الفريد الذي سيميزه عن غيره من المواقع . تعد لغة ال CSS صديقة للغة ال HTML فهي دائماً مرافقة لها وبجانبها في تصميم وإنشاء صفحات الويب. تشكل كل من هاتان اللغتان الأساس لكل موقع، فال HTML هي أساس كل عناصر صفحة الويب أما ال CSS فهي أساس تصميم وشكل الموقع فبدونها ستظل مواقع الويب نصًا عاديًا على خلفيات بيضاء, عليك تعلم CSS ان اردت ان تكون مطور واجهات متخصص, كما عليك بالتأكيد تعلم HTML لبناء اي موقع متميز. قبل البدء ببناء و تطوير لغة ال CSS
<span>3 - تعلم لغة Bootstrap</span>
Bootstrap عبارة عن إطار عمل (Framework) مجاني يستخدم لتسهيل عملية تصميم صفحات الويب على المطور حيث يوفر له كلاسات CSS جاهزة يمكنه إستخدامها لإظهار العناصر (Components) التي نضيفها في الصفحات بشكل جميل جداً و متجاوب مع حجم الصفحة (Responsive) مثل الأزرار (Buttons), مربعات النص (Text Fields), القوائم المنسدلة (Drop Down Menus) و غيرها من الأشياء المساعدة مثل رسائل التنبيهات التي نظهرها للمستخدم.



<span>4 - تعلم لغة JavaScript</span>
في الماضي، كانت صفحات الويب ثابتة، كصفحات الكتاب. وكانت الصفحة الثابتة تعرض المعلومات في تخطيط ثابت، ولم تكن تفعل كل ما نتوقعه الآن من أي موقع ويب حديث. وظهرت JavaScript كتقنية من جانب المتصفح لإضفاء مزيدٍ من الديناميكية على تطبيقات الويب. وباستخدام JavaScript، يمكن للمتصفحات الاستجابة لتفاعل المستخدم وتغيير تخطيط المحتوى على صفحة الويب.
 
<span>5 - تعلم لغة React js</span>

ال react هي مكتبة مبنية للبرمجة بلغة JavaScript تم بناؤها من قبل شركة فيسبوك والهدف منها فقط تقديم طريقة سهلة وسلسلة وقوية في الوقت ذاته لبناء الواجهات حيث تخفف العبء عن المبرمجين أثناء بناء أي واجهة، وهي مبنية على أساس مفهوم الـ Component

            </p>
        </div>


    </div>
    </div>
  )
}

export default Frontend
