import React from 'react'

const Graphic = () => {
  return (
    <div className='graphic'>
      <div className="container">
        <h2 className="graphic-title">
        كل ما يجب تعرفه عن كورس Graphic Designer
        </h2>
        <div className="box">
            <h2 className="box-title">
            تفاصيل كورس Graphic Designer
            </h2>
              
             <p>
             في Freedom بنقدملك كورس جرافيك ديزاين متكامل من الصفر الي الاحتراف والي هيساعدك توصل لهدفك
من خلال الكورس هتقدر تتعلم اهم برامج الجرافيك ديزاين : <br />
1- illustrator <br />
- هتقدر تتعلم فيه الفيكتور ارت اللي 
هيفتحلك المجال انك تشتغل و تتعلم الموشن جرافيك
- هتقدر تتعلم تصميم لوجوهات باحترافيه  
 <br />2- photoshop  <br />
- هتتعلم عليه تصميم بوستات السوشيال ميديا ب إحترافيه 
- هتقدر تتعلم تصميم الكروت الشخصيه وغيرها 
- هتتعلم عليه الدمج بين الصور باحترافيه والتعديل ع الصور 
- هتتعلم ازاي تتعامل مع العمله و تعرض شغلك ع البيهانس 
 <br />3- indesign <br />
- هتتعلم ازاي تصمم مجله كامله وتصدرها للطباعه 
- هتتعلم ازاي تنسق الكتابه ف البرنامج و تظبطها مع الصور

             </p>
        </div>

        <div className="box">
        <h2 className="box-title">
         ما هو  Graphic Designer

         <p>
         يعرف فن الجرافيك (بالإنجليزية: Graphic Art) بأنّه أيّ نوع من أنواع الفن الذي يعبّر عنه بصورة مرئية، مثل: الرسم، والتصوير الفوتوغرافي، والطباعة، وهو الشكل التقليدي من الفنون الجميلة، وعادةً ما يُطبّق هذا النوع من الفنون على الأسطح المستوية.[١] من الممكن تطبيق فن الجرافيك أيضًا بشكل رسومات، وخطوط، وأنماط أصلية للفنون الزخرفية، وذلك في حالة تطبيقه على الأثاث، والمنسوجات، والسيراميك، والديكورات الداخلية، وفي الهندسة المعمارية.[١]
         </p>
            </h2>
        </div>
        <div className="box">
            <h2 className="box-title">
                أنواع الجرافيك
            </h2>
            <p>
            يؤدي تصميم الجرافيك إلى تسهيل مهمة إيصال المعلومة إلى المتلّقي، وهناك أنواع متعددة من الجرافيك، وهي كما يأتي :

            <ul>
                <li>تصميم الرسوم المتحركة</li>
                <li>تصميم الرسوم البيانية للتغليف</li>
                <li>تصميم الرسوم الجرافيكي البيئي</li>
                <li>تصميم الرسوم الجرافيك للنشر</li>
                <li>تصميم الجرافيك للتسويق والأعلان</li>
                <li>تصميم الجرافيك للهوية المرئية</li>
            </ul>
            </p>
        </div>
        <div className="box">
            <h2 className="box-title">
                أستخدامات التصميم الجرافيكي
            </h2>
            <p>
 يُستخدم التصميم الجرافيكي في العديد من مناحي الحياة اليومية، ومن هذه الاستخدامات ما يأتي:
<ul>
    <li>الإبداع والابتكار.</li>
    <li> التمتُّع بالخيال الواسع.</li>
    <li>مهارة وحرفية عالية في انتقاء الألوان.</li>
    <li>القدرة على إيصال الأفكار بطرق متنوعة، ومختلفة، وفريدة من نوعها.</li>
    <li>إمكانية العمل على الأجهزة الحديثة.</li>
    <li>معرفة كيفية التعامل مع التغذية الراجعة بشكل صائب.</li>
    <li>إجادة استخدام برامج الرسم على الكمبيوتر.</li>
    <li>الدقة، والاهتمام بأدق التفاصيل.</li>
    <li>حُب الفنون والتصميم، والرسم.</li>
    <li>التمتُّع بثقافة واسعة.</li>
</ul>


            </p>
        </div>
      </div>
    </div>
  )
}

export default Graphic
