import React from 'react'

const Icdl = () => {
  return (
    <div className='icdl'>
      <div className="container">
        <h2 className="icdl-title">
        كل ما يجب تعرفه عن كورس ICDL 
        </h2>
        <div className="box">
            <h2 className="box-title">
             تفاصيل كورس ICDL
            </h2>
            <p>
  في Freedom بنقدملك كورس ICDL من البدايه إلى الاحتراف ودا من خلاله هتقدر تحترف التعامل مع الكمبيوتر وبرامج ال Office 
✅Windows <br />
✅Word <br />
✅Excel <br />
✅PowerPoint <br />
✅Internet and Gmail <br />
ب انتهاء دراستك للكورس معانا بنضمنلك تقدم ف اي شركة وانت جاهز بالكامل <br />
            </p>
        </div>
        <div className="box">
         <h2 className="box-title">
          برنامج Microsoft Word
         </h2>
         <p>
         مايكروسوفت وورد هو احد تطبيقات الاوفيس الخاص بالويندوز ويعتبر من افضل البرامج المستخدمة في تحرير النصوص مثل كتابة الاخبار والابحاث والكتب وغيرها ويتميز بإمكانيات كثيرة لتنسيق النصوص مثل نوع الخط وحجمه ولونه وشكله بالإضافة الى مميزات عديدة ستتعرف عليها في هذا الكورس، مايكروسوفت Word هو ملك لشركة مايكروسوفت وتقوم كل عام بإطلاق نسخة جديدة مليئة بالتحديثات والوظائف الممتعة التي تساعد محررا النصوص وهو ايضا احد اجزاء شهادة الـ  ICDL الدولية.

         </p>

        </div>

        <div className="box">
         <h2 className="box-title">
          برنامج Microsoft Excel
         </h2>
         <p>
         الاكسيل هو أشهر وأفضل البرامج المجدولة وهو ملك لشركة مايكروسوفت ويأتي ضمن تطبيق برنامج الأوفيس على الويندوز ويتميز برنامج مايكروسوفت Excel بقدرته الجبارة في التعامل مع البيانات حيث يمكنك من إنشاء العديد من الجداول و تخزين عدد لا نهائي من البيانات بها وهذا أمر عادي ولكن قدرته الجبارة في معالجة هذه البيانات وإتاحة القدرة بتنفيذ العديد من الأوامر المتعددة عليها مثل الدوال الرياضية والفلترة والتعامل مع النصوص فضلا على امكانية عرض هذه البيانات في شكل رسومات بيانية متعددة، و هو ايضا احد اجزاء شهاده ICDL  الدولية.
         </p>
        </div>

        <div className="box">
         <h2 className="box-title">
          برنامج Microsoft PowerPoint
         </h2>
         <p>
         البوربوينت هو أحد تطبيقات برنامج الاوفيس المثبت على ويندوز مايكروسوفت وهو أحد موديلات شهادة الـ ICDL  ويعتبر الباوربوينت افضل برامج العروض التقديمية واشهرها فلا توجد محاضرة بدون عرض تقديمي من صنع برنامج البوربوينت ولا عرض لمنتج أو خدمة إلا وقد استخدم في إنشاء هذا العرض، تقوم فكرة عمل برنامج PowerPoint  على الشرائح (Slides  ) وتقتصر الشريحة الواحدة على توصيل معلومة بسيطة وعرض محتواها في شكل نقاط وليس نص ويتميز برنامج مايكروسوفت PowerPoint بقدراته في اضافه الأنيميشن على الشرائح وتحديد طريقة عرض كل نقطة داخل الشريحة الواحدة بالإضافة إلى القوة الجبارة في تحويل هذه الشرائح الى فيديوهات متحركة رائعة.
         </p>
        </div>

      </div>
    </div>
  )
}

export default Icdl
