import React from 'react'

const Python = () => {
  return (
    <div className='python'>
       <div className="container">
       <h2 className="python-title">
           كل ما يجب تعرفه عن كورس Python
        </h2>
      
        <div className="box">
          <h2 className="box-title">
            تفاصيل كورس Python

            <p>
            منحة البرمجه المقدمه من Freedom Academy <br />
هتقدر تتعلم من خلالها أهم لغة في البرمجه وهي لغة ال Python <br />

📌 مدة المنحة شهر ونص <br />
📌3 محاضرات أسبوعيا <br />
📌كل محاضره مدتها ساعتين <br />

من خلال دراستك معانا للمنحة هتقدر توصل لمرحلة الاحتراف في ال Python <br />
هتقدر تنفذ Website كامل أو Mobile Application <br />
وتبدأ تدخل أسواق العمل الحر وتربح بالعملة الصعبه <br />

مميزات المنحه : <br />
🟣تدريب عملي ونظري <br />
🟣 عمل CV احترافي لكل متدرب <br />
🟣شهادة خبرة بعد انتهاء المنحه <br />
🟣إمكانية توفير فرص تدريب للمتميزين <br />
            </p>
          </h2>
        </div>
        <div className="box">
        <h2 className="box-title"> ما هي لغة Python</h2>
       <p>
       إن كنت تنجز الكثير من الأعمال باستخدام الحاسوب، فستجد نفسك بحاجة إلى تأدية بعض المهام بصورة آلية أوتوماتيكية. فعلى سبيل المثال قد ترغب في إنجاز عملية بحث واستبدال على عدد كبير من الملفات، أو إعادة تسمية وترتيب مجموعة من ملفات الصور وبطريقة معقدة. قد ترغب ربّما بكتابة قاعدة بيانات صغيرة، أو إنشاء تطبيق يمتلك واجهة رسومية خاصّة، أو حتى لعبة صغيرة.

إن كنت من المحترفين في مجال تطوير البرمجيات فإنّك ستلجأ على الأرجح إلى استخدام العديد من مكتبات اللغات C/C++/Java ولكنّك ستجد أنّ عمليات الكتابة ثم التصريف ثم الاختبار ثم إعادة التصريف قد أصبحت سلسلة من العمليات المتكررة البطيئة للغاية.

لربّما كنت تكتب حزمة اختبار لمثل هكذا مكتبة فوجدت أن كتابة شيفرة الاختبار أمر متعب للغاية، أو أنّك كتبت برنامجًا بمقدوره استخدام لغة ملحقة، ولكنّك لا ترغب بتصميم وتضمين لغة جديدة للتطبيق.

كل ما سبق هو ما تقوم به لغة برمجة بايثون.

يمكنك كتابة شيفرة صدفة في أنظمة يونكس (Unix) أو كتابة ملفات batch في نظام ويندوز (Windows) لأداء بعض من المهمات التي ذكرناها سابقًا، ولكن شيفرات الصدفة (shell scripts) ملائمة لنقل الملفات وإجراء التعديلات على البيانات النصية، وهي ليست ملائمةً إطلاقًا للتطبيقات ذات الواجهات الرسومية أو الألعاب. يمكنك أن تكتب برنامجًا باستخدام اللغات C/C++/Java ولكنّ قد تأخذ عملية النسخة الأولية وقتًا طويلًا. تمتاز لغة بايثون بسهولة الاستخدام، وتوفّرها في أنظمة Windows، و Mac OS X و Unix، وستساعدك في إنجاز أعمالك بسرعة أكبر.

لغة بايثون سهلة الاستخدام، ولكنّها في الوقت عينه لغة برمجية حقيقية، تقدّم دعمًا وبنية أكبر للبرامج الكبيرة من شيفرات الصدفة أو ملفات batch. ومن جانب آخر، تقدّم بايثون قدرة أكبر على تفحّص الأخطاء من لغة C، ونظرًا لكون بايثون لغة من المستوى العالي جدًّا، فإنّها تتضمّن أنواعًا ذات مستوى عالٍ أيضًا، كالمصفوفات المرنة والقواميس. ولمّا كانت الأنواع أكثر شمولية في لغة بايثون فبالإمكان الاستفادة من اللغة في حل مشاكل أكبر من تلك التي يمكن حلّها بواسطة لغات مثل Awk أو حتى Perl، ومع ذلك فإنّ الأمور تكون في بايثون على أقلّ تقدير بنفس سهولة اللغتين السابقتين.

تتيح لغة بايثون تقسيم البرنامج إلى حزم متعددة يمكن إعادة استخدامها في برامج بايثون أخرى، وتمتلك اللغة مجموعة كبيرة من الحزم الأساسية التي يمكن استخدامها أساسا لبرامجك، أو أمثلة تساعدك في البدء بتعلم البرمجة بلغة بايثون. تقدّم بعض هذه الحزم أمورًا مثل نظام المدخلات والمخرجات للملفات file I/O، استدعاءات النظام، sockets وحتى واجهات لبعض حزم الواجهات مثل Tk.

لغة بايثون هي لغة مفسّرة (interpreted، وليست مبنية [compiled]) ما يتيح توفير الكثير من الوقت أثناء عملية التطوير نظرًا لانتفاء الحاجة إلى إجراء عملية التصريف والربط. يمكن استخدام المفسِّر بصورة تفاعلية، الأمر الذي يسهّل التعامل مع الخصائص التي تقدّمها اللغة، ولكتابة برامج لغرض التدريب أو الاختبار، أو لاختبار دالة أثناء عملية تطوير برنامج ما، إضافة إلى إمكانية استخدام المفسّر كآلة حاسبة.

إحدى مميزات لغة بايثون أنها تتيح كتابة البرامج بأسلوب مختصر ومقروء، فالبرامج المكتوبة في بايثون تكون عادة أقصر بكثير من مكافئاتها في لغات C، أو C++‎، أو Java، ولعدّة أسباب:

تتيح أنواع البيانات ذات المستوى العالي إمكانية استخدام تعابير معقدّة في عبارة واحدة.
يجري تجميع العبارات باستخدام الإزاحات، بدلًا من أقواس البداية والنهاية.
لا حاجة للتصريح عن نوع المتغير أو الوسيط.
بايثون قابلة للتجديد: إن كنت تجيد البرمجة باستخدام لغة C فمن السهل حينئذٍ أن تضيف دالة ضمنية إلى اللغة أو حزمة جديدة إلى المفسر، وذلك إمّا لتأدية المهام الضرورية بأقصى سرعة، أو لربط برامج بايثون مع المكتبات التي تكون متوفّرة بالصيغة الثنائية فقط (مثل مكتبات الرسوميات الخاصّة بشركة). وعند إجراء عملية الربط يصبح بالإمكان ربط مفسِّر بايثون بتطبيق مكتوب بلغة C واستخدامه كأداة ملحقة أو كلغة أوامر في ذلك التطبيق.

سمّيت لغة بايثون بهذا الاسم تيمّنًا بعرض تلفزيوني كانت تقدّمه قناة BBC والذي يحمل الاسم «Monty Python’s Flying Circus» ولا رابط بينه وبين الحيوانات الزاحفة.
       </p>
        </div>

        <div className="box">
          <h2 className="box-title">أستخدامات لغة Python</h2>
          <p>
          تتسم لغة بايثون بأنها لغة عامة الغرض أي أنها غير متخصصة في مجال واحد بل يمكن استخدامها في مجالات عدة وشاع استخدام لغة بايثون في المجالات التالية: <br />

<ul>
  <li>علم البيانات وتحليلها</li>
  <li>علم الإحصاء والتحليل الإحصائي</li>
  <li>تعلم الآلة والذكاء الاصطناعي</li>
  <li>بناء تطبيقات سطح مكتب لمختلف الأنظمة</li>
  <li>بناء مواقع وتطبيقات ويب عبر إطار العمل فلاسك Flask</li>
  <li>برمجة الأنظمة والأنظمة المدمجة</li>
  <li>أتمتة المهام</li>
  <li>وغيرها من المجالات الأخرى فلا يسعنا حصرها كلها.</li>
</ul>

هنالك الكثير من اللغات عامة الغرض ولكنها لم تُستخدم هذا الاستخدام الواسع كما لغة بايثون، إذ قوة لغة بايثون واستقرارها والطيف الواسع من المكتبات المكتوبة بها أيضًا أكسبها الكثير من الثقة وساهم في نشرها وتوسعها في شتى المجالات فباتت تُستخدم في الكثير من المشاريع بمختلف المجالات بل تصدرت بها أحيانًا مثل مجال الذكاء الاصطناعي وتعلم الآلة وحتى في المشاريع مفتوحة المصدر مثل مشاريع بايثون مفتوحة المصدر من شركة ناسا وغيرها.== بنية لغة بايثون == بيان للبنية العامة للغة بايثون وبعض الأمور العامة مثل التعليقات وتسمية المعرّفات وغيرها.
          </p>
        </div>
       </div>
    </div>
  )
}

export default Python
