import React from 'react';
import './GermanLearning.css';

const GermanLearning = () => {
  return (
    <div className='german-learning'>
      <div className="container">
      <h2 className='german-learning-title' style={{backgroundColor : '#ccc'}}>
      لا تحتاج لأي خبرة سابقة للدخول في هذا المسار التعليمي والمسار مجاني بالكامل
      </h2>

     <div className="box">
      <h2>
      اللغة الألمانية 
      </h2>
      <p>
        <strong>
        لماذا تريد تعلم اللغة الألمانية   ؟   <br />

        </strong>
        هناك العديد من الأسباب التي تجعلك تتعلم اللغة الألمانية – ومن أهم هذه الاسباب هي: <br />
<ul>
    <li>
ألمانيا هي قلب أوروبا، و المكان الاقتصادي الأفضل
    </li>
    <li>
    الدراسة في المانيا لا تحتاج الى دفع رسوم تعليمية.

    </li>
<li>
الحصول على الفيزا الألمانية يحتاج لتعلّم اللغة أولاً.

</li>
    
    <li>
اللغة الرسمية في المانيا هي الألمانية وليس هناك لغات أخرى.

    </li>

    <li>
امكانية الحصول على عمل مضمونة 100% اذا كنت تجيد اللغة الألمانية فقط..

    </li>

    <li>
تعلّم الألمانية يعتبر تحدي صعب، وبالتأكيد ستنجح في هذا التحدّي.
    </li>
 في بدايات تعلم اللغة، لن يطلب منك التكلم بطلاقة ، وانما فقط يتوقع أن تقوم بالتعبير عما في داخلك بأيّ وسيلة <br />
</ul>
           </p>

      <button>خطة الدراسة</button>
     </div>


     <div className="box">
      <h2>
       مستويات الغة الألمانية
      </h2>

      <p>
      مستوى A1 <br />
      مستوى A2<br />
      مستوى B1 <br />
      مستوى B2 <br />
      مستوى C1 <br />

      تتم ترجمة الأحرف A و B و C في مستويات اللغة على النحو التالي : <br />

      الاستخدام الأولي للغة (A1 و A2) <br />
      الاستخدام المستقل للغة (B1 و B2) <br />
      الاستخدام الكفء للغة (C1: مستوى متقدم من الكفاءة ؛ C2: إجادة اللغة الأم تقريبًا) <br />

      تتوافق هذه الأحرف بشكل أو بآخر مع تسميات المستوى المستخدمة سابقًا (ولا تزال أحيانًا حتى اليوم) المستوى الأساسي (= A) والمستوى المتوسط ​​(= B) والمستوى المتقدم (= C). الاختلاف الوحيد هو أنه لم يحدد أحد مسبقًا ما يجب أن تعنيه هذه المستويات بالضبط.



    </p>

      <button>خطة الدراسة</button>
     </div>


     <div className="box">
      <h2>
      كم أحتاج من الوقت لتعلم اللغة الألمانية
      </h2>

      <p>
      قد يكون تعلم اللغة الألمانية أمرًا صعبًا بعض الشيء ، خاصة إذا كنت من مواليد لغة لا تنتمي إلى عائلة اللغات الهندو أوروبية. ولكن ، بغض النظر عن لغتك الأم ، وحتى إذا كانت اللغة الألمانية تبدو صعبة بالنسبة لك في البداية ، فلا تثبط عزيمتك.

إذا كنت تتساءل عما إذا كان هناك أي طرق مختصرة أو طرق محددة لتعلم اللغة الألمانية ، فقد ذكرنا القليل في هذا الدليل الذي سيساعدك على إحراز تقدم أسرع. لا توجد فترة زمنية محددة تضمن لك النجاح في تعلم اللغة الألمانية ، ولكن الأهم هو الاتساق. لن تستيقظ ذات صباح وتجد نفسك تتحدث الألمانية بطلاقة.

هذا يحدث فقط في الأفلام. إذا اتخذت خطوة واحدة فقط في كل مرة ، فسترى النتائج تحدث بسرعة. قد يستغرق تعلم لغة جديدة وقتًا مختلفًا اعتمادًا على العديد من العوامل مثل خبرتك السابقة والتعرف على اللغة، ومرونتك الزمنية ، ومقدار العمل الذي تقوم به في عملية التعلم ، والتحفيز ، وما إلى ذلك.

ولكن ، إذا كنت تتدرب يوميًا لمدة لا تقل عن ثلاثة إلى ستة أشهر ، فمن المحتمل أن تكون قادرًا على التعامل مع محادثة يومية مع صديق والقيام بأشياء مثل الدخول إلى المقهى وتقديم طلب باللغة الألمانية.

تعتمد مدة دراسة مستويات اللغة على عدد المستويات التي تريد دراستها وكذلك بناء خطة الدرس في المعهد الذي تريد دراسة اللغة الألمانية به . <br />

<strong>
مدة تعلم اللغه الألمانية للوصول إلى مستوى معين:

</strong>

    </p>

    <table border='2' cellPadding='10'>
        <tr>
            <th>المستوي</th>
            <th>الفترة الزمنية</th>
        </tr>
        <tr>
            <td>A1</td>
            <td>شهرين</td>
        </tr>
        <tr>
            <td>A2</td>
            <td>شهرين   </td>
        </tr>
        <tr>
            <td>B1</td>
            <td> ثلاث شهور</td>
        </tr>
        <tr>
            <td>B2</td>
            <td> ثلاث شهور</td>
        </tr>

        <tr>
            <td>C1</td>
            <td>  4 أشهر بحد أقصى</td>
        </tr>
    </table>

      <button>خطة الدراسة</button>
     </div>


     </div>
    </div>
  )
}

export default GermanLearning
