import React from 'react';
import './FrenchLearning.css';

const FrenchLearning = () => {
  return (
    <div className='french-learning'>
      <div className="container">
      <h2 className='french-learning-title'>
      لا تحتاج لأي خبرة سابقة للدخول في هذا المسار التعليمي والمسار مجاني بالكامل
      </h2>

     <div className="box">
      <h2>
      اللغة الفرنسية
      </h2>

      <p>
      اللغة الفَرَنْسية (بالفرنسية: Le français أو La langue française) هي إحدى اللغات الرومانسية، تحتل المركز السابع من حيث اللغات الأكثر تحدثاً في العالم والمرتبة 18 من حيث اللغة الأكثر تحدثاً كلغة أم، حيث يتكلم بها نحو 80 مليون شخص في جميع أنحاء العالم كلغة رسمية أساسية، وحوالي 190 مليون شخص كلغة رسمية ثانية، وحوالي 274 مليون شخص في جميع أنحاء العالم. وينتشر هؤلاء الناطقون بها في حوالي 54 بلداً حول العالم. وهي اللغة الوحيدة الموجودة بالقارات الخمس بجانب اللغة الإنجليزية

معظم من ينطق بالفرنسية كلغة أصلية يعيشون في فرنسا، حيث نشأت اللغة. أما البقية فيتوزعون بين كندا، وبلجيكا، وسويسرا، وأفريقيا الناطقة بالفرنسية، لوكسمبورغ، وموناكو.

تنحدر اللغة الفرنسية من اللغة اللاتينية لغة الإمبراطورية الرومانية، مثلها مثل كثير من اللغات العالمية الأخرى كالبرتغالية، الإسبانية، وإيطالية، والكتلانية والرومانية. يشبهها في هذا النسب أيضاً بعض اللغات المحلية كاللغة القسطانية أو الأُكْسِيتَانِيَّة وهي اللغة التي يتكلم بها أهل أوكسيطانيا بجنوب فرنسا، واللغة النابولية لغة سكان نابولي بإيطاليا، وغيرها.

كما أن تطور اللغة الفرنسية قد تأثر كثيراً باللغات السلتية وهي فرع من عائلة اللغات الهندية الأوروبية. وذلك لكون اللغات السلتية كانت منتشرة في مناطق واسعة في غرب ووسط أوروبا من قبل الشعوب السلتية أو الكلتية في العصور ما قبل الرومانية، أما الآن فهي محدودة في مناطق ساحلية صغيرة في شمال غرب أوروبا. وتأثر اللغة الفرنسية أيضاً باللغة الجرمانية القادمة مع غزاة شعب الإفرنج الذين دخلوا فرنسا بعد انتهاء السيطرة الرومانية عليها.

الفرنسية لغة رسمية في 29 بلداً، تشكل بمعظمها ما يسمى الفرانكوفونية، أي مجتمع الدول الناطقة بالفرنسية. هي أيضاً لغة رسمية في جميع وكالات الأمم المتحدة، وفي عدد كبير من المنظمات الدولية.

تبعاً للاتحاد الأوروبي، فإن 129 مليون مواطن من الدول السبع والعشرين الأعضاء في الاتحاد الأوروبي يتكلمون الفرنسية (أي بنسبة 26% من أصل 497,198,740 وهو العدد الكلي لمواطني الاتحاد الأوروبي). منهم 65 مليون مواطن (أي 12%) يتكلمون الفرنسية كلغة أساسية، و14 بالمئة يعلنون أنهم يتكلمونها كلغة ثانية، مما يجعلها ثالث أكبر لغة تحكى كلغة ثانية في الاتحاد الأوروبي، بعد الإنكليزية والألمانية. بالإضافة إلى ذلك، فإنه ما قبل تنامي دور اللغة الإنكليزية في مطلع القرن العشرين، فإن الفرنسية كانت تعدّ اللغة الأبرز والأوسع انتشاراً في المجال الدبلوماسي بين القوى الأوروبية والاستعمارية ككل، وأيضاً كانت اللغة الأوسع انتشاراً بين النخب التعليمية في أوروبا.
      </p>

      <button>خطة الدراسة</button>
     </div>


     <div className="box">
      <h2>
       مستويات الغة الفرنسية
      </h2>

      <p>
 مبتدىء A0 <br />
إبتدائي A1-A2 <br />
ماقبل المتوسط A2-B1 <br />
متوسط B1 <br />
فوق المتوسط B2 <br />
متقدم C1-C2 <br />
    </p>

      <button>خطة الدراسة</button>
     </div>


     <div className="box">
      <h2>
         الخطة الشاملة لتعلم اللغة الفرنسية
      </h2>

      <p>
       <strong>
        1. ابدأ بتعلم أساسيات اللغة الفرنسية:
       </strong>
عند تعلم اللغة الفرنسية عليك البدء بتعلم الأساسيات كالحروف والأرقام والأفعال والضمائر. فإذا لم يكن لديك معرفة بهذه الأساسيات فلن تتمكن من معرفة كيفية تركيب الجمل، ولن تستطيع استخدام المفردات والتعابير التي تحفظها لتركيب الجمل والتحدث بالفرنسية.
يمكنك تعلم أساسيات اللغة الفرنسية بدراسة دورة سلسلة تعلم اللغة الفرنسية. التي تتضمن أساسيات اللغة الفرنسية كالحروف والأرقام مع شرح الأفعال الأساسية المستخدمة بشكل متكرر ويومي وشرح الضمائر بطريقة سهلة ومبسطة. بالإضافة لبعض المفردات والتعابير المستخدمة بشكل يومي كالتعريف عن النفس وعبارات اللقاء والوداع، لبناء القاعدة الأساسية التي تساعدك على تعلم اللغة الفرنسية بحيث يمكنك إتقانها والتحدث بها.



<strong>
2. تعلم الأزمنة في اللغة الفرنسية:
</strong>

إن الأزمنة في اللغة الفرنسية لها أهمية كبيرة، خصوصاً أنها تختلف عن الأزمنة في اللغة العربية والإنجليزية، حيث يوجد عدد أكبر من الأزمنة ولكل زمن من الأزمنة طريقة تصريف واستخدامات مختلفة عن بقية الأزمنة. ولكنها تعتبر سهلة وبسيطة عندما تتم دراستها بشكل جيد، لذلك أنصح بمتابعة دورة الأزمنة في اللغة الفرنسية (التي من المفضل البدء بدراستها أثناء دراسة دورة سلسلة تعلم اللغة الفرنسية).

فمن خلال دورة الأزمنة في اللغة الفرنسية ستتعرف على جميع الأزمنة في اللغة الفرنسية وتصريف الأفعال والحالات الشاذة لها ومتى نستخدم كل زمن من الأزمنة بطريقة مبسطة وواضحة، وهذا سيساعدك على فهم الأزمنة الأساسية في اللغة الفرنسية والمستخدمة بشكل يومي، بالإضافة لبعض الأزمنة التي تستخدم عادة في الأعمال الأدبية كالقصص والروايات كالزمن الماضي البسيط والماضي البعيد والمستقبل السابق، حيث لا نستخدمهم بكثرة في الحياة اليومية ولكن من الأفضل أخذ فكرة عنهم لمعرفتهم وفهمهم عند قراءة كتاب أو صحيفة.

<strong>
3. حفظ المفردات والمصطلحات:
</strong>
إن حفظ المفردات والمصطلحات تعتبر من أساسيات تعلم اللغة، فمن دون وجود مخزون من المفردات والمصطلحات التي تحفظها وتلفظها بشكل جيد لن تتمكن من التحدث أو الكتابة باللغة التي تتعلمها. لذلك قم بالتركيز على حفظ المفردات ذات الصلة بحياتك اليومية بالإضافة للمفردات المتعلقة باهتماماتك ومجالك الدراسي أو المهني لأن هذه هي الكلمات التي سوف تستخدمها بشكل متكرر ويومي، يمكنك على سبيل المثال البدء بتعلم أهم الكلمات والمفردات الأساسية من خلال هذه الجداول: الأكل والطعام، أعضاء الجسم، الأفعال، الأعداد، أدوات المنزل، الصفات، الظروف، الحيوانات والألوان.

يمكنك دراسة هذه الجداول والتدرب عليهم كتابياً وسماع اللفظ الصحيح لهم من خلال الاختبارات الموجودة في موقع Sylingo، وهذا سيساعدك على حفظ الكلمة ومعناها وطريقة لفظها بشكل صحيح، كما يمكنك على سبيل المثال كتابة المفردات باللغة الفرنسية على ملصقات ووضع الملصقات على الأشياء في غرفتك أو منزلك، فعندما ترى النافذة ستقرأ الملصقة "la fenêtre" أو الباب "la porte" وستحفظ أسماء الأشياء وسيصبح لديك قاعدة كبيرة من المفردات.

بعد أن أصبح لديك مخزون كافي من المفردات والمصطلحات وبعد أن تعرفت على الأزمنة وقواعد اللغة الفرنسية حان الوقت للاستفادة من هذه المهارات والبدء بتركيب الجمل الخاصة بك، ويمكنك تعلم ذلك من خلال دراسة دورة أهم الجمل الفرنسية، التي تحتوي أهم الجمل المستخدمة في الحياة اليومية كالجمل المستخدمة في المدرسة أو في المطعم أو عند الطبيب والعديد من الجمل الأخرى.

بعد أن أصبح لديك مخزون كافي من المفردات والمصطلحات وبعد أن تعرفت على الأزمنة وقواعد اللغة الفرنسية حان الوقت للاستفادة من هذه المهارات والبدء بتركيب الجمل الخاصة بك، ويمكنك تعلم ذلك من خلال دراسة دورة أهم الجمل الفرنسية، التي تحتوي أهم الجمل المستخدمة في الحياة اليومية كالجمل المستخدمة في المدرسة أو في المطعم أو عند الطبيب والعديد من الجمل الأخرى.

<strong>
4. تعلم قواعد اللغة الفرنسية:
</strong>
إن تعلم قواعد اللغة الفرنسية يساعدك على تركيب جمل واضحة ومترابطة، والتحدث والكتابة بشكل احترافي ومتقن، وبالتالي التمكن من التعبير عن نفسك بشكل أفضل وتركيب الجمل الأكثر تعقيداً والتي تحتاج معرفة جيدة ومستوى متقدم من القواعد.

للبدء بتعلم قواعد اللغة الفرنسية قم بدراسة دورة قواعد اللغة الفرنسية - المستوى الأول، والتي من خلالها ستتعرف على قواعد اللغة الفرنسية الأساسية التي من الضروري معرفتها كالمبني للمعلوم والمبني للمجهول، والمذكر والمؤنث، والأمر الحاضر، والأمر الماضي، وكيفية طرح الأسئلة، والعديد من القواعد الأخرى التي ستسهل عليك فهم ما تقرأه وما تسمعه بالإضافة إلى التحدث والكتابة بشكل سليم وصحيح قواعدياً. 


بعد الانتهاء من دورة قواعد اللغة الفرنسية - المستوى الأول يمكنك الانتقال إلى دورة قواعد اللغة الفرنسية - المستوى الثاني، في هذه السلسلة من قواعد اللغة الفرنسية ستتعرف بشكل مفصل وبسيط على قواعد اللغة الفرنسية للمستوى المتوسط والمتقدم، كقواعد الكلام المنقول، والسبب والنتيجة، وقاعدة "Le subjonctif" في الحاضر والماضي.

<strong>
5. اقرأ باستمرار لتتمكن من تمييز الأسماء المذكرة أو المؤنثة:
</strong>

اللغة الفرنسية كاللغة العربية تحتوي على أسماء مذكرة وأسماء مؤنثة ولكن غالباً ما تكون على عكس اللغة العربية حيث لا تتطابق الأسماء في اللغة الفرنسية مع الأسماء في اللغة العربية في حالة المذكر أو المؤنث، "فالباب - la porte" مذكر في اللغة العربية ولكنه مؤنث في اللغة الفرنسية، ولهذا لا نستطيع اعتماد اللغة العربية كمرجع لمعرفة ما إذا كان الاسم مذكر أو مؤنث. فتمييز نوع الاسم يعتبر من أكبر العوائق لمتعلمي اللغة الفرنسية، لأنه لا توجد طريقة لتخمين أو معرفة نوع الكلمة، لذلك فالطريقة الأمثل هي حفظها كما هي.

ولكن في المقابل فإنه من المستحيل حفظها بشكل مجرد لذلك فأفضل طريقة لحفظ أنواع الأسماء هي القراءة باستمرار، مع إيلاء اهتمام لما إذا كانت الأسماء مسبوقة بـ "une - la" أو "un - le". هذا سيساعدك على معرفة نوع الأسماء الفرنسية بشكل عفوي وتلقائي وبكفاءة، دون الشعور بالملل. حيث أن  الفرنسيون أنفسهم يعتمدون هذه الطريقة لمعرفة ما إذا كان الاسم مذكر أو مؤنث، حيث يقومون بحفظ الاسم مع أداة التعريف أو النكرة الخاصة به. فالأسماء في حالة المؤنث تكون مسبوقة بـ une أو la، بينما الأسماء في حالة المذكر تكون مسبوقة بـ un أو le.


يمكنك متابعة الدروس التالية لتعلم كيفية التفريق بين المذكر والمؤنث:
- المعرّف وغير المعرّف: والذي ستتعرف من خلاله على أدوات المعرف وغير المعرف للأسماء في حالة المذكر والمؤنث مع أمثلة عليه.
- المذكر والمؤنث في اللغة الفرنسية: ستتعرف في هذا الدرس على نوع الاسم ما إذا كان مذكراً أو مؤنثاً عن طريق النهايات (les terminaisons du mot) أو اللاحقة (suffixe).



 <strong>
 6. حاول تحدث الفرنسية كل يوم!
 </strong>

 حاول أن تعتاد على التفكير باللغة الفرنسية، كأن تفكر ماذا سوف تفعل في يومك، إلى أين سوف تذهب وما إلى ذلك، هذا سوف يساعدك على تذكر الكلمات والأفعال والتدرب على استخدامها عند تركيب الجمل. كما أنصحك بالتدرب على التحدث والكتابة باللغة الفرنسية من خلال التواصل مع الأشخاص الناطقيين باللغة الفرنسية أو الأشخاص الذين يتعلمون الفرنسية، حيث يمكنك التحدث معهم وإرسال الرسائل عبر مواقع تبادل اللغات مثل interpals.net أو hellotalk.com أو tandem.net.

كما يمكنك تسجيل صوتك والاستماع إلى ما قلته وتصحيح الأخطاء القواعدية أو اللفظية التي ارتكبتها، الهدف من الأمر هو التدرب على التحدث بطلاقة ومن دون تأتأة والاستماع لطريقة نطقك للكلمات. فالفكرة الأساسية من التحدث والكتابة بالفرنسية هي التدرب على استخدام الأزمنة المختلفة كالزمن الحاضر والماضي والمستقبل. 

في البداية قد ترتكب العديد من الأخطاء عند التحدث أو الكتابة باللغة الفرنسية، ولكن مع الممارسة والتدريب ستتجنب معظم الأخطاء التي ترتكبها. أنصحك بمتابعة دورة أخطاء شائعة في اللغة الفرنسية والتي تحتوي على أهم الأخطاء الشائعة التي يرتكبها الأشخاص الذين يتعلمون الفرنسية.

كما أنصحك بمتابعة دورة الفروقات في اللغة الفرنسية التي تتضمن مجموعة من الدروس التي تحتوي على العديد من الكلمات أو التعابير المتشابهة والتي قد نخطىء بها في اللغة الفرنسية، فمن خلال هذه السلسلة ستتعرف على أهم المتشابهات والفروق فيما بينها مع أمثلة وتمارين عليها لتوضيح المعنى.


 <strong>
 7. تجنب الأخطاء قدر المستطاع:

 </strong>

بالتأكيد كما رأينا هناك العديد من الأخطاء التي قد نرتكبها والتي تؤخر عملية تعلمنا وتؤثر على مهاراتنا في التحدث والنطق بشكل صحيح، لذلك علينا الانتباه منذ بداية تعلمنا أن نتجنب في الوقوع في مثل هذه الأخطاء لأنها ستؤثر علينا وعلى عملية تعلم اللغة بشكل كبير دون أن نشعر بذلك، سواء على صعيد قدرتنا على التحدث والنطق بشكل صحيح أو على صعيد حماسنا واستمرارنا في تعلم اللغة والوصول لهدفنا المنشود. لذلك أنصحكم بمتابعة دورة أخطاء شائعة في اللغة الفرنسية.
كما أنصح بمتابعة تجربتي في تعلم اللغة الفرنسية وتجنب الأخطاء والعثرات التي واجهتني.
ولا تنسى الانضمام معنا إلى مجموعتنا الخاصة في تعلم اللغة الفرنسية على الفيس بوك.

وفي النهاية يعتبر تعلم الفرنسية أمر مفيد وممتع في نفس الوقت، لذلك فإن وضع خطة جيدة لتعلمها أمر بالغ الأهمية فهو يرسم الخطوط العريضة التي تسهل عليك عملية تعلم اللغة وتجعلها عملية ممتعة وبسيطة.
    </p>

      <button>خطة الدراسة</button>
     </div>


     </div>
    </div>
  )
}

export default FrenchLearning