import React from 'react';
import './ItalyLearning.css';

const ItalyLearning = () => {
  return (
    <div className='italy-learning'>
    <div className="container">
        <h2 className="italy-learning-title">
        لا تحتاج لأي خبرة سابقة للدخول في هذا المسار التعليمي والمسار مجاني بالكامل
        </h2>


       <div className="box">
        <h2>اللغة الأيطالية</h2>

        <p>
        اللغة الإيطالية (بالإيطالية: La Lingua Italiana أو Italiano عن هذا الملف It-italiano.ogg (؟·معلومات))؛ هي إحدى اللغات التي تنتمي إلى عائلة اللغات الهندوأوروبية الرومانسية، يتحدثها نحو 60 مليون نسمة في إيطاليا وحدها، ونحو 70 مليون آخرين في جميع أنحاء العالم. وتعد اللغة الإيطالية إحدى اللغات الرسمية الأربع في الاتحاد السويسري، كما أنها اللغة الرسمية في سان مارينو بالإضافة لكونها اللغة الأولى بعد اللاتينية لدولة الفاتيكان. لقد تبنت الدولة اللغة الإيطالية القياسية (الفصحى) بعد توحيد إيطاليا عام 1815 معتمدة في ذلك على لهجات مدينة فلورنسا. وتأثرت الإيطالية في مراحل تطورها الطويلة باللهجات المحلية المتعددة بالمدن الإيطالية التي كانت وقتها تعد لغات قائمة بذاتها لكل مدينة - دولة، إلا أن الإيطالية وفي المقام الأول تعد الابنة البكر للغة اللاتينية، فقد تأثرت بشكل مباشر باللاتينية وورثت منها الكثير. فمن بين العديد من اللغات الرومانسية التي تنسب في أصلها للاتينية، تعد اللغة الإيطالية هي الأقرب من اللاتينية من جهة مفرادتها اللغوية، التقارب اللغوي في المفردات بين الإيطالية واللغات الرومانسية الأخرى على النحو التالي: 89 % مع الفرنسية، 87 % مع الكتلانية، 85 % مع السردينية، 82 % مع الإسبانية، 78 % مع الرايتو - رومانس، 77 % مع اللغة الرومانية، 52 % مع المالطية.

اللغة الإيطالية تُدَرّس على نطاق واسع في العديد من المعاهد والجامعات حول العالم، ولكن نادراً ما تدرس كلغة أولى، ففي الواقع تحتل اللغة الإيطالية المرتبة الرابعة أو الخامسة كأكثر اللغات الأجنبية تدريساً على مستوى العالم. ففي الأقاليم الأنجلوفونية (المتحدثة بالإنجليزية) بكندا، تعد اللغة الإيطالية - بعد الفرنسية - ثالث أكثر اللغات تدريسا بالمدارس والجامعات. أما في الأقاليم الفرانكوفونية (المتحدثة بالفرنسية) فتعتبر الإيطالية الثالثة في الترتيب بعد الإنجليزية كأكثر اللغات التي يتم تدريسها هناك. أما في الولايات المتحدة الأمريكية والمملكة المتحدة فاللغة الإيطالية تصنف الثالثة من حيث الترتيب والأهمية بعد (الإسبانية والفرنسية بالولايات المتحدة على الترتيب) و(الفرنسية والإسبانية بالمملكة المتحدة على الترتيب). عالمياً تعد اللغة الإيطالية الخامسة من حيث الترتيب بعد الإنجليزية والإسبانية والفرنسية والألمانية .

أما على الصعيد الأوروبي، فاللغة الإيطالية تمثل اللغة الأم لنحو 13 % من الأوروبيين (نحو 65 مليون منهم في إيطاليا نفسها) وكلغة ثانية تمثل نحو 3 % (14 مليون) من إجمالي السكان بأوروبا، ومن بين الدول الأعضاء بالإتحاد الأوروبي التي تدرس فيها اللغة الإيطالية كلغة ثانية مالطا (61 %)، كرواتيا (14%)، سلوفينيا (12 %)، النمسا (11 %)، رومانيا (8%)، فرنسا (6%)، وأخيرا اليونان (6%). كما أنها تعد لغة ثانية ذات أهمية في ألبانيا وسويسرا وهم ليسوا أعضاء بالأتحاد الأوروبي حالياً. كما تعد الإيطالية لغة مؤثرة في اللهجة الليبية بسبب الاستعمار الإيطالي لليبيا سنة 1911 والتونسية كما تدرس المناهج التونسية اللغة الإيطالية بالإضافة إلى الفرنسية والإنجليزية.
        </p>
        <button>خطة الدراسة</button>
       </div>

       <div className="box">
        <h2>مستويات اللغة الأيطالية</h2>
        <p>
        هى مستويات معرفة اللغة ( فى هذة الحالة اللغة الايطالية )   مصنفة وفقا لمعايير اللائحة الاوربية . <br />

ال QCE  تحدد 6 مستويات عامة والذى يبدو انهم يشملون جيدا عملية الاستيعاب للغة : <br />
ـــ     A1 ، مستوى الاحتكاك <br />
ـــ     A2 ، مستوى البقاء <br />
ـــ     B1 ، مستوى العتبة¹ (الحد الادنى ) <br />
ـــ      B2 ، مستوى متقدم <br />
ــ     C1  ، مستوى الفعالية <br />
ــ     C2 ، مستوى الاتقان <br />


تحديدا المستويان A1 و A2 يوازيان المستوى الابتدائى ، والمستويان B1 و B2 يوازيان المستوى المتوسط ، والمستويان C1 و C2 يوازيان المستوى المتقدم
 وهنا سنتناول بالذكر المقياس الشمولى  والذى بفضل ال6 مستويات  من المستوى الابتدائى الى المستوى الاكثر تقدما يسمح بمعرفة الى اى درجة يعرف الشخص لغة ما
        </p>
       </div>

       <div className="box">
        <h2>مراحل تعلم اللغة الأيطالية</h2>
        <p>
      
      <strong>
        1. تعلم اللغة الإيطالية يعد مدخلاً للغات اللاتينية الأخرى
      </strong>
      تتشارك اللغة الإيطالية الأصل مع اللغات الفرنسية والإسبانية والبرتغالية والرومانية، وهذا يعني أنها تتشابه مع تلك اللغات في الكثير من الكلمات والقواعد، ما يجعل تعلم اللغة الإيطالية بمثابة مفتاح لتعلم هذه اللغات والتحدث بها في المستقبل.

    <strong>
    2. السفر إلى إيطاليا للدراسة أو العمل
    </strong>
    تأتي إيطالياً في المرتبة الثامنة بتصنيف أفضل اقتصادات العالم الخاص بموقع Investopedia المرموق، كما تمتلك 12 جامعة ضمن أفضل 500 جامعة على مستوى العالم، ما يجعل من تعلم اللغة الإيطالية تذكرة لا غنى عنها للعمل أو للدراسة في واحدة من أفضل بلاد العالم على مستوى الاقتصاد والتعليم.

   <strong>
   3. فهم الثقافة الإيطالية
   </strong>

   هل تعلم أن 60% من التراث الفني العالمي موجود في إيطاليا؟ ليس ذلك فقط، ولكن تلعب إيطالياً دوراً رائداً في الفنون بأنواعها في وقتنا الحديث على مستوى العالم، كما تمتلك حضارة ممتدة لآلاف السنين خلفت آثاراً وتراثاً يخلب الألباب، لذلك فإن تعلم اللغة الإيطالية سيساعدك على الاندماج في الثقافة الإيطالية وفهمها بشكل أفضل.

 <strong>
 4. ابحث عن المترادفات بين اللغة الإيطالية والإنجليزية
 </strong>
 تمتلك اللغتين الإيطالية والإنجليزية العديد من الكلمات ذات الأصول المشتركة، والتي في أحيان كثيرة تكون بنفس النطق مع اختلافات طفيفة، ومن أمثلة تلك الكلمات:
 <br /> 
<p className='words'>
الكلمات التي تنتهي بنهاية al- في الإنجليزية
تأخذ الكلمات التي تنتهي بنهاية al- في الإنجليزية نهاية ale- في الإيطالية لتعطي نفس المعنى، مثل:

Artificial (صناعي) – Artificiale

Canal (قناة) – Canale

Final (نهائي) – Finale

Original (أصلي) – Originale

<p className='words'>
الكلمات التي تنتهي بنهاية ble- في الإنجليزية
تأخذ الكلمات التي تنتهي بنهاية ble- في اللغة الإنجليزية نهاية bile- في اللغة الإيطالية، مثل:

Adorable (رائع) – Adorabile

Impossible (مستحيل) – Impossibile

Terrible (فظيع) – Terribile

Miserable (بائس) – Miserabile

سيكون تعلم اللغة الإيطالية أسهل كثيراً بالنسبة إليك إذا كنت متحدثاً باللغة الإنجليزية وتستطيع التعرف على تلك الكلمات ذات الأصول المشتركة.
</p>

<strong>
5. شاهد الدراما الإيطالية
</strong>

طريقة مهمة يمكنك بها تعلم اللغة الإيطالية هي أن تبدأ في مشاهدة الدراما الإيطالية بأفلامها ومسلسلاتها. ستعطيك تلك الطريقة فهماً عميقاً للثقافة الإيطالية واستخدام اللغة في الحياة اليومية، ما سيجعل من تعلم اللغة الإيطالية بالنسبة إليك تجربة حية يمكنك الشعور بها والتفاعل معها على مستويات مختلفة، ومن أشهر المنصات المتاحة التي يمكنك من عليها مشاهدة الدراما الإيطالية هي NETFLIX.

<strong>
6. استمع إلى الكتب الصوتية والأغاني باللغة الإيطالية
</strong>

تتمتع إيطاليا بتراث ثقافي وفني غني للغاية، وينعكس ذلك على اللغة الإيطالية بشكل كبير. في الواقع فإن اللغة الإيطالية هي لغة موسيقية بامتياز، تشعر حين سماع محادثة عادية تنطق بها بأنك تستمع إلى غناء مستمر. لذلك، فإن الاستماع إلى الكتب الصوتية والأغاني الإيطالية يمكنه أن يساعدك كثيراً على تعلم اللغة الإيطالية واستيعابها بشكل أفضل، وتمرين أذنيك على تمييزها والتفاعل معها، ومن أبرز المنصات التي يمكنك الاستماع من عليها إلى الكتب الصوتية باللغة الإيطالية هي (Audible) و(Audiobooks)، أما الأغاني فيمكنك سماعها عن طريق تطبيقات مثل (Spotify) أو (Soundcloud).

<strong>
7. اقرأ قصص الأطفال باللغة الإيطالية

</strong>
من أفضل الطرق لتعلم اللغة الإيطالية هي قراءة قصص الأطفال، فتلك القصص معدة سلفاً لتكون سهلة يسيرة على الأشخاص الذين يمتلكون قدراً ضئيلاً للغاية من اللغة الإيطالية، وتحتوى تلك القصص على أبسط القواعد النحوية والكلمات المستخدمة في الحياة اليومية، ما يجعل من قرائتها رحلة ممتعة في تعلم اللغة الإيطالية، ومن أشهر المواقع التي يمكنك من عليها قراءة قصص الأطفال باللغة الإيطالية هو The Fable Cottage، وميزة ذلك الموقع أنه يعرض لك النص الأصلي والنص المترجم بالإضافة إلى أداء صوتي للقصص، ما يجعل القراءة على هذا الموقع تجربة متكاملة.

<strong>
8. تمرن على المحادثة كل يوم
</strong>
بعد أن تتعلم جزءاً كافياً من أساسيات اللغة الإيطالية، سيتوجب عليك البدء في ممارسة التحدث بها. وتتعدى فائدة ممارسة التحدث مجرد تكوين جمل وإيصال أفكارك ومشاعرك بلغتك الجديدة، ولكنها أيضاً تفيدك للغاية في تحسين لهجتك واصلاح أخطائك اللغوية التي قد لا تنتبه إليها بغير التحدث، ما يساعدك على تعلم اللغة الإيطالية بشكل أسرع وأكثر فعالية، ومن أفضل المواقع والتطبيقات التي يمكنك ممارسة التحدث عليها باللغة الإيطالية هي (Italki) و(Speaky) و(LingQ).
</p>


        </p>
       </div>


    </div>
    </div>
  )
}

export default ItalyLearning