import React from 'react';
import './EnglishLearning.css';

const EnglishLearning = () => (
  <div className='english-learning'>
    <div className="container">
      <h2 className='english-learning-title' style={{backgroundColor : '#ccc'}}>لا تحتاج لأي خبرة سابقة للدخول في هذا المسار التعليمي والمسار مجاني بالكامل
      </h2>

      <div className="box">
        <h2>اللغة الأنجليزية</h2>
        <p>
         الإنجليزية البريطانية هي اللهجة القياسية للغة الإنجليزية تحدُّثًا وكتابةً في المملكة المتحدة. توجد اختلافات في اللغة الإنجليزية الرسمية المكتوبة في المملكة المتحدة. على سبيل المثال، تُستخدم صفة وي بشكل حصري تقريبًا في أجزاء من اسكتلندا وشمال شرق إنجلترا وأيرلندا وأحيانًا يوركشاير، بينما يسود القليل في أماكن أخرى. ومع ذلك، هناك درجة ذات مغزى من التوحيد في اللغة الإنجليزية المكتوبة داخل المملكة المتحدة، ويمكن وصف ذلك بالمصطلح الإنجليزية البريطانية. ومع ذلك، فإن أشكال اللغة الإنجليزية المنطوقة تختلف بشكل كبير عنها في معظم مناطق العالم الأخرى حيث يتم التحدث باللغة الإنجليزية، لذا فإن تطبيق مفهوم موحد للغة الإنجليزية البريطانية هو أكثر صعوبة للتطبيق على اللغة المحكية. وفقًا لتوم ماك آرثر في دليل أكسفورد للغة الإنجليزية العالمية، فإن الإنجليزية البريطانية تشارك «كل الغموض والتوترات في كلمة» بريطاني «ونتيجة لذلك يمكن استخدامها وتفسيرها بطريقتين، على نطاق أوسع أو ضيق، ضمن نطاق من التعتيم والغموض».
        </p>
        <button>خطة الدراسة</button>
      </div>

      <div className="box">
        <h2> كورس المحادثة (Conversation) باللغة الانجليزية</h2>
        <p>
        دورة المحادثة باللغة الانجليزية تعلمك التواصل باللغة الانجليزية في مواقف الحياة في المواقف العامة كالتعارف والتنقل والسفر والتعبير عن الحالة الصحية والمشاعر والمواقف الطارئة، كما تتناول مواقف في العمل والدراسة كالتعامل مع زملاء العمل والعملاء واستقبال الزوار الاجانب وتلقي التعليمات والتحدث في الهاتف والتواصل خلال الاجتماعات والمقابلات الخاصة بالعمل وتقديم العروض التقديمية وشرح الموضوعات الخاصة بعملك


                  </p>
        <button>خطة الدراسة</button>
      </div>

      <div className="box">
        <h2> مستويات اللغة الإنجليزية والتقدم
        </h2>
        <p>
          تستند دوراتنا على الإطار الأوروبي المرجعي المشترك للغات (CEFRL) وهو معيار دولي لوصف القدرة اللغوية عبر القراءة والكتابة والإستماع والتحدث.

          في الإستشارة الخاصة بك سوف نساعدك على فهم مستوى اللغة الإنجليزية الحالي الخاص بك، ما تريد تحقيقه والعثور على الدورة الأفضل بالنسبة لك.

          إذا كنت بحاجة إلى إثبات مستواك في اللغة الإنجليزية للدراسة أو العيش أو العمل في الخارج، يمكننا مساعدتك في التحضير لامتحان IELTS أو حجز امتحان كامبردج للغة الإنجليزية.

          يوجد 6 مستويات: <br />

          <span className='ss'>
            مبتدىء A0  <br />
            إبتدائي A1-A2 <br />
            ماقبل المتوسط A2-B1 <br />
            متوسط B1 <br />
            فوق المتوسط B2 <br />
            متقدم C1-C2 <br />
          </span>
        </p>
        <button>خطة الدراسة</button>
      </div>

      
      <div className="box">
        <h2> مستويات اللغة الأنجليزية للأطفال</h2>
        <div className="level">
      <h3>مستوي A1</h3>
      <p>
      المستوى A1: مبتدئ / إبتدائي يتوافق مع المستخدمين الأساسيين للغة، أي القادرين على التواصل في المواقف اليومية مع تعابير ومفردات شائعة الإستخدام.
      </p>
      <span>
  <b className='b'>
  المهارات في المستوى A1
الطلاب في هذا المستوى يمكن أن:
    </b> <br />

يفهموا ويستخدموا التعابير اليومية المستخدمة بشكل متكرر جداً، فضلاً عن عبارات بسيطة لتلبية الإحتياجات الفورية.
يغرّفوا عن أنفسهم والآخرين ويطرحوا/يجيبوا على الأسئلة حول تفاصيل شخصية مثل المكان الذي يعيشون فيه، والأشياء التي يمتلكونها ومعارفهم
يتفاعلوا بطريقة بسيطة شريطة أن يتحدث الشخص الآخر ببطء ووضوح وأن يكون مستعدًّا للتعاون.
      </span>
      
        </div>

        <div className="level">
      <h3>مستوي A2</h3>
      <p>
      المستوى A2: المستوى الإبتدائي / ما قبل المتوسط يتوافق مع المستخدمين الأساسيين للغة، أي القادرين على التواصل في المواقف اليومية مع التعابير الشائعة الإستخدام والمفردات الأساسية.


      </p>
      <span>
  <b className='b'>
  سيتمكن الطلاب في هذا المستوى من:

    </b> <br />
    فهم جًمل وتعابيرات اجتماعية مستخدمة بشكل متكرر وذات صلة بالمجالات الأقرب إلى اهتماماتهم (مثل المعلومات الشخصية والأسرية، والهوايات، والأماكن ذات الأهمية، والعمل، وما إلى ذلك).
التواصل في المهام اليومية البسيطة التي لا تتطلب أكثر من مجرد تبادل بسيط ومباشر للمعلومات بما يتعلق بمسائل مألوفة وروتينية.
وصف الأحداث الماضية وبيئتهم واحتياجاتهم الفورية بعبارات بسيطة.
      </span>
      
        </div>

        <div className="level">
      <h3>مستوي B1</h3>
      <p>
      المستوى B1: مستوى قبل المتوسط/ المتوسط يتوافق مع المستخدمين المستقلين للغة، الذين لديهم الطلاقة اللازمة للتواصل بطريقة محدودة مع الناطقين بها.




      </p>
      <span>
  <b className='b'>
  سيتمكن الطلاب في هذا المستوى من:
    </b> <br />
    التعرف على النقاط الرئيسية للنصوص الواضحة حول مواضيع مألوفة، مثل العمل والدراسة والترفيه.
التعامل مع معظم الحالات التي قد تنشأ في رحلة إلى المناطق التي تستخدم اللغة الإنجليزية.
إنتاج نصوص بسيطة ومتماسكة حول الموضوعات التي تكون مألوفة أو التي لها مصلحة شخصية.
وصف الخبرات والأحداث والرغبات والتطلعات، فضلاً عن تبرير الآراء أو شرح الخطط لفترة وجيزة
      </span>
      
        </div>

        <div className="level">
      <h3>مستوي B2</h3>
      <p>
      المستوى B2: المستوى المتوسط / فوق المتوسط يتوافق مع المستخدمين المستقلين باللغة، الذين لديهم الطلاقة اللازمة للتواصل دون جهد مع الناطقين بها.

      </p>
      <span>
  <b className='b'>
  سيتمكن الطلاب في هذا المستوى من:
    </b> <br />
    التعرف على الأفكار الرئيسية للنص المعقد على كل من المواضيع الملموسة والمجردة، بما في ذلك المناقشات التقنية في مجال تخصصهم.
التفاعل مع درجة من الطلاقة والعفوية التي تجعل التفاعل المنتظم مع الناطقين بها ممكن دون إجهاد لأي من الطرفين.
إنتاج نص واضح ومفصّل حول مجموعة واسعة من المواضيع وشرح وجهة نظر حول قضية بموضوعية وإدراك مزايا وعيوب الخيارات المختلفة.
      </span>
      
        </div>

        <div className="level">
      <h3>مستوي C1 </h3>
      <p>
   
      المستوى C1: مستوى متقدم يتطابق مع المستخدمين المتقنين للغة، أي تلك القدرة على أداء المهام المعقدة عند مواجهة مجموعة مختلفة من السيناريوهات.

      </p>
      <span>
  <b className='b'>
  سيتمكن الطلاب في هذا المستوى من:
    </b> <br />
    التعرف على مجموعة واسعة من النصوص الأكثر تطلباً، والأطول، والتعرف على معناها الضمني.
التعبيرعن النفس بطلاقة وعفوية دون الكثير من البحث الواضح عن التعبير الصحيح.
إستخدام اللغة بمرونة وفعالية للأغراض الإجتماعية والأكاديمية والمهنية.
إنتاج نصوص واضحة ومنظمة ومفصلة حول مواضيع معقدة.
      </span>
      
        </div>

        <div className="level">
      <h3>مستوي C2</h3>
      <p>
   
      المستوى C2: مستوى الإتقان يتوافق مع المستخدم الذي يتقن اللغة، الذين هم قادرون على أداء المهام المعقدة المتعلقة بالعمل والدراسة.


      </p>
      <span>
  <b className='b'>
  سيتمكن الطلاب في هذا المستوى من:
    </b> <br />
    التعرف بكل سهولة عملياً على كل ما يسمع أو يقرأ.
تلخيص المعلومات والحجج من مختلف المصادر المنطوقة والمكتوبة، وتقديمها بشكل متماسك وموجز.
التعبير عن النفس بتلقائية، وبطلاقة ودقة عالية ، بالإضافة على القدرة على التفرقة بين المعاني الصعبة في المواقف المعقدة.
      </span>
      
        </div>
        <button>خطة الدراسة</button>
      </div>
    </div>
  </div>
)

export default EnglishLearning